tutorials/ThinAirfoil/ThinAirfoil_7k_M100_a1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/elisa/TESI/MESH_GENERATION";
    case "PROFILO_LENTICOLARE";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
inlet-outlet
{
    type patch;
    physicalType supersonicInlet;
    nFaces 42;
    startFace 9626;
}

body
{
    type patch;
    physicalType slip;
    nFaces 200;
    startFace 9668;
}

defaultFaces
{
    type empty;
    physicalType empty;
    nFaces 12996;
    startFace 9868;
}
)

// ************************************************************************* //
